LawrenceStanton/TB6612FNG_Driver/Demo/TB6612FNG_Driver_Demo.ioc
#MicroXplorer Configuration settings - do not modify
Mcu.Family=STM32F0
PA6.GPIOParameters=GPIO_Label
ProjectManager.MainLocation=Core/Src
ProjectManager.ProjectFileName=TB6612FNG_Driver_Demo.ioc
ProjectManager.KeepUserCode=true
Mcu.UserName=STM32F051C6Tx
Mcu.PinsNb=9
TIM3.AutoReloadPreload=TIM_AUTORELOAD_PRELOAD_ENABLE
ProjectManager.NoMain=false
RCC.PLLCLKFreq_Value=8000000
ProjectManager.functionlistsort=1-MX_GPIO_Init-GPIO-false-HAL-true,2-SystemClock_Config-RCC-false-HAL-false,3-MX_TIM3_Init-TIM3-false-HAL-true,4-MX_I2C1_Init-I2C1-false-HAL-true
PB11.GPIO_Label=STBY
ProjectManager.DefaultFWLocation=true
PA6.GPIO_Label=BPWM
PB0.GPIO_Label=BI1
NVIC.SVC_IRQn=true\:0\:0\:false\:false\:true\:false\:false
ProjectManager.DeletePrevious=true
PB10.Locked=true
PB11.Signal=GPIO_Output
PinOutPanel.RotationAngle=0
TIM3.Channel-PWM\ Generation4\ CH4=TIM_CHANNEL_4
RCC.FamilyName=M
ProjectManager.StackSize=0x400
Mcu.IP2=SYS
Mcu.IP3=TIM3
Mcu.IP0=NVIC
Mcu.IP1=RCC
Mcu.UserConstants=
ProjectManager.TargetToolchain=STM32CubeIDE
PB10.GPIO_Label=AI1
Mcu.ThirdPartyNb=0
Mcu.IPNb=4
ProjectManager.PreviousToolchain=STM32CubeIDE
TIM3.Period=65535
PB2.GPIOParameters=GPIO_Label
PB11.GPIOParameters=GPIO_Label
Mcu.Pin6=PB11
Mcu.Pin7=VP_SYS_VS_Systick
Mcu.Pin8=VP_TIM3_VS_ClockSourceINT
VP_TIM3_VS_ClockSourceINT.Signal=TIM3_VS_ClockSourceINT
Mcu.Pin0=PA6
PB1.Locked=true
Mcu.Pin1=PA7
TIM3.Channel-PWM\ Generation1\ CH1=TIM_CHANNEL_1
GPIO.groupedBy=Group By Peripherals
PB10.Signal=GPIO_Output
Mcu.Pin2=PB0
TIM3.ClockDivision=TIM_CLOCKDIVISION_DIV1
Mcu.Pin3=PB1
Mcu.Pin4=PB2
Mcu.Pin5=PB10
ProjectManager.ProjectBuild=false
PB2.Signal=GPIO_Output
board=custom
NVIC.SysTick_IRQn=true\:0\:0\:false\:false\:true\:false\:true
ProjectManager.LastFirmware=true
ProjectManager.FirmwarePackage=STM32Cube FW_F0 V1.11.0
MxDb.Version=DB.5.0.60
PB0.GPIOParameters=GPIO_Label
ProjectManager.BackupPrevious=false
MxCube.Version=5.6.1
TIM3.Prescaler=1
PB1.GPIO_Label=APWM
File.Version=6
VP_SYS_VS_Systick.Mode=SysTick
TIM3.IPParameters=AutoReloadPreload,Prescaler,Period,ClockDivision,Channel-PWM Generation1 CH1,Channel-PWM Generation4 CH4
NVIC.NonMaskableInt_IRQn=true\:0\:0\:false\:false\:true\:false\:false
NVIC.PendSV_IRQn=true\:0\:0\:false\:false\:true\:false\:false
SH.S_TIM3_CH1.0=TIM3_CH1,PWM Generation1 CH1
ProjectManager.FreePins=false
RCC.IPParameters=CECFreq_Value,FamilyName,HSICECFreq_Value,PLLCLKFreq_Value,PLLMCOFreq_Value,TimSysFreq_Value
ProjectManager.AskForMigrate=true
Mcu.Name=STM32F051C6Tx
ProjectManager.HalAssertFull=false
PB0.Locked=true
ProjectManager.ProjectName=TB6612FNG_Driver_Demo
ProjectManager.UnderRoot=true
PB2.Locked=true
RCC.HSICECFreq_Value=32786.88524590164
RCC.PLLMCOFreq_Value=4000000
ProjectManager.CoupleFile=false
Mcu.Package=LQFP48
PA6.Signal=S_TIM3_CH1
PB1.Signal=S_TIM3_CH4
RCC.TimSysFreq_Value=8000000
PA7.GPIO_Label=BI2
PA7.Locked=true
NVIC.ForceEnableDMAVector=true
KeepUserPlacement=true
ProjectManager.CompilerOptimize=6
ProjectManager.ToolChainLocation=
VP_SYS_VS_Systick.Signal=SYS_VS_Systick
PB2.GPIO_Label=AI2
ProjectManager.HeapSize=0x200
NVIC.HardFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false
SH.S_TIM3_CH1.ConfNb=1
ProjectManager.ComputerToolchain=false
SH.S_TIM3_CH4.ConfNb=1
RCC.CECFreq_Value=32786.88524590164
PB10.GPIOParameters=GPIO_Label
PB0.Signal=GPIO_Output
PA7.GPIOParameters=GPIO_Label
ProjectManager.CustomerFirmwarePackage=
VP_TIM3_VS_ClockSourceINT.Mode=Internal
PB11.Locked=true
ProjectManager.DeviceId=STM32F051C6Tx
ProjectManager.LibraryCopy=1
SH.S_TIM3_CH4.0=TIM3_CH4,PWM Generation4 CH4
PB1.GPIOParameters=GPIO_Label
PA7.Signal=GPIO_Output
PA6.Locked=true
isbadioc=false
